Revit 2027 API
BuiltInFailures.CopyPasteFailures.NoSketchPlane Property
 Can't paste because no Work Plane is defined in the View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSketchPlane { get; }
Public Shared ReadOnly Property NoSketchPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSketchPlane {
	FailureDefinitionId^ get ();
}
static member NoSketchPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace